read_verilog ../rtl/4bitalu.v
synth -top alu_4bit
abc -liberty /usr/local/share/pdk/sky130A/libs.ref/sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
write_verilog ../synthesis/4bitalu_net.v
show
stat
